# Run 'brew bundle' to install all the packages in this file

brew "tmux"
brew "vim"

brew "fzf"
brew "ripgrep"
brew "autojump"

brew "thefuck"
brew "htop"
brew "wget"
brew "bat"
brew "tree"
brew "watch"
brew "md5sha1sum"
brew "duf" # better disk free util
brew "dust" # better disk used util

# GNU utils
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "grep"
brew "gawk"
# Note, gnu coreutils commands are all prefixed with a 'g' like 'gls' for the GNU ls command. If you want to use the commands with the normal names and overwrite the mac ones, then add gnubin to your PATH. Run `brew info coreutils` for the path. They should all be in the form: export PATH="/opt/homebrew/opt/gnu-tar/libexec/gnubin:$PATH"
# Same thing for the other GNU ones: coreutils, findutils, gnu-tar, gnu-sed, grep
# Add a line for each one to your ~/.shellrc.extra
