# Run 'brew bundle' in this dir to install all the packages in this file

brew "tmux"
brew "vim"

brew "fzf"
brew "ripgrep"
brew "autojump"

# terminal general utils 
brew "wget"
brew "tree"
brew "btop"
brew "bat" # better cat
brew "eza" # better ls
brew "duf" # better disk free util
brew "dust" # better disk used util
brew "ncdu" # better disk used util that's actually interactive so reduces time spent looking at various folders to see what's taking up space

# other
brew "thefuck"
brew "watch"
brew "moreutils" # only for the 'vipe' utility for editing text in the middle of a pipe sequence
brew "aichat" # LLM QA

# data processing 
brew "diff-so-fancy" # better diff UI
brew "jq"
brew "md5sha1sum"

# GNU utils
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "grep"
brew "gawk"
# Note, gnu coreutils commands are all prefixed with a 'g' like 'gls' for the GNU ls command. If you want to use the commands with the normal names and overwrite the mac ones, then add gnubin to your PATH. Run `brew info coreutils` for the path. They should all be in the form: export PATH="/opt/homebrew/opt/gnu-tar/libexec/gnubin:$PATH"
# Same thing for the other GNU ones: coreutils, findutils, gnu-tar, gnu-sed, grep
# Add a line for each one to your ~/.shellrc.extra

# Other linux utils 
brew "telnet"

# GUI apps (casks)
cask "sloth" # better GUI version of lsof to see all your open files and sockets in use by which processes
